<template>
   <div class="agreement-page">
       <h1>预定合同</h1>
       <section>
           <h2>第一条 特别提示</h2>
           <p>
               悦百分代理预订平台展示的产品由具备相关资质的商家直接提供，悦百分仅作为网络预订平台。
               商家充分借用悦百分预订平台，推出全方位的产品，并负责产品销售、资源确认、合同签署、发票开具、
               行程安排等全部环节的服务。悦百分作为产品的展示平台，您对本协议的接受并不意味着悦百分成为产品交易的参与者，
               对前述交易悦百分仅提供技术支持，不对商家行为的合法性、有效性及产品的真实性、
               合法性及有效性作任何明示或暗示的担保。
            </p>
            <p>
                在预订开始前，请仔细阅读本须知，产品页面中的附件条款也作为协议的补充内容。
                当您开始预订该产品时，表明您已仔细阅读并接受协议中的所有条款。
            </p>
       </section>
       <section>
           <h2>第二条 词语定义</h2>
           <p> 1. 商家：通过悦百分代理预订平台展示产品的具有合法资质的的公司/旅行社。</p>
           <p> 2. 悦百分预订平台：由悦百分提供系统平台技术，商家自行进行产品上线及售卖服务的第三方服务平台。</p>
       </section>
       <section>
           <h2>第三条 产品内容与价格</h2>
           <p>
               悦百分展示的产品价格仅为参考价格，由于产品价格的波动性，商家可能因为机票、
               酒店等的价格变动而适度调整其在悦百分网上已公布的产品的价格。您预订的所有产品的价格及产品价格包含的内容，
               以商家与您最后确认为准。非特别标明，产品价格不包含办理护照、入台证、签证或签注费、行李物品的保管及超重费、
               个人消费、航空人身意外保险费及您应自行投保的其它保险费用。
           </p>
       </section>
       <section>
           <h2>第四条 订单生效与合同生效</h2>
           <p>
                您在悦百分预订产品成功后，商家会给您关于订单的确认，您应在与商家约定的付款期前及时付清给您确认的应付款，
                您确认的订单才生效。但如您未及时付清相关费用，而此时产品的价格、内容或标准等有发生变化，
                悦百分及其商家对此不承担任何责任。待您付款成功，并且商家给予您最终确认后，商家与您之间的合同生效。
           </p>
       </section>
       <section>
           <h2>第五条 您主动更改或取消已生效订单</h2>
           <p>
                订单生效后，您若需要更改或取消该订单内的任何项目，请务必在行程开始前通知商家更改或取消需求。
                商家会尽量满足您的需求，但您必须全额承担因变更或取消带来的损失及可能增加的费用，
                包括但不限于签证或签注费、订房损失费、机票费及其它车船交通费用等。
                若您所预订的产品在目的地停留的日期部分或全部处在国家法定节假日或其它部分国际性、国家性、地方性重大节日期间，
                鉴于资源的特殊状况，已生效订单如进行更改或取消将产生全额损失。
           </p>
       </section>
       <section>
           <h2>第六条 因商家原因变更或取消已生效订单</h2>
           <p>
                在您按要求付清应付费用并经商家最终确认后，如因商家原因，致使您的产品不能成行或内容发生更改的，
                商家会第一时间通知您。或在经您同意后，调整产品中的行程内容或接待标准，退还差额费用。
                如调整后的产品价格高于原来价格，您须补足多出的相应差额。
           </p>
       </section>
       <section>
           <h2>第七条 安全事项</h2>
           <p>
                1. 您应确保被服务人身体条件适合本次服务/出行，如被服务人为孕妇或有心脏病、高血压、呼吸系统疾病等病史，请在征得医院专业医生同意后服务/出行。
           </p>
           <p>
                2. 您保证提供的证件、通讯联络方式、配送地址等相关资料均真实有效。
           </p>
           <p>
                3. 您应尊重当地的法律法规、宗教信仰、民族习惯和风土人情，自觉保护当地自然环境。
           </p>
           <p>
                4. 您在服务中应注意人身财产安全，妥善保管自己的证件及行李物品，如果发生人身意外、伤害或随身携带行李物品遗失、被盗、被抢等情况，由您自行承担。
           </p>
           <p>
                5. 您在服务过程中如对产品商家的服务质量有异议，应积极与产品商家沟通积极争取在服务过程中解决。
           </p>
       </section>
       <section>
           <h2>第八条 第三方责任</h2>
           <p>
                由于出入境管理局、各国领馆、航空公司、保险公司、及其他有权机构等不可控制的第三方、原因导致您人身、
                财产权益受到损害的，包括但不限于，航班延误或取消、护照延期、签证拒签或未按时出签、不得出入境等，
                应由您方自行协商解决，必要时请及时联系商家协助处理。
           </p>
       </section>
       <footer>
           <button @click="back">确定</button>
       </footer>
    </div>
</template>
<script>
export default {
  methods: {
      back() {
          this.$router.back()
      }
  }
}
</script>
<style lang="scss" scoped>
    .agreement-page {
        padding: 15px 15px 50px 15px;
        background: #fff;
        section {
            margin: 15px 0;
        }
        h1 {
            margin-top: 10px;
            font-size: 24px;
        }
        h2 {
            margin-bottom: 10px;
            font-size: 20px;
        }
        p {
            text-indent: 2em;
            font-size: 16px;
            line-height: 1.5;
        }
        footer {
            position: fixed;
            left: 0;
            bottom: 0;
            width: 100%;
            button {
                width: 100%;
                padding: 15px;
                color: #fff;
                font-size: 18px;
                letter-spacing: .5em;
                background: rgb(0, 161, 229);
            }
        }
    }
</style>